app/views/users/show.html.erb

SELECT "photos".* FROM "photos"
---

<% Photo.all.each do |photo| %>