app/controllers/photos_controller.rb

  def create
    @photo = current_user.photos.new
    if @photo.save(photo_params)
---
INSERT INTO "photos" ("image_content_type", "image_file_name", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image_content_type", "image/jpeg"], ["image_file_name", "cute-kitten-playing.jpg"], ["image_file_size", 87341], ["image_updated_at", "2014-09-10 21:06:26.962578"], ["user_id", 1]]