app/controllers/tags_controller.rb

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = 1 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @photo = Photo.find_by_id(params[:photo_id])
    @tag = Tag.new(tag_params)
    @user = User.find_by_id(current_user)

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tags" ("created_at", "photo_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-10 21:06:41.955390"], ["photo_id", 1], ["updated_at", "2014-09-10 21:06:41.955390"], ["user_id", 1]]
---
  def create
    @photo = Photo.find(params[:photo_id])
    @tag = @photo.tags.new(tag_params)
    if @tag.save