app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "password_digest", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "users".* FROM "users"
SELECT "tags".* FROM "tags"
---
  def show
    slkdjflskdjf
    @photos = current_user.photos
    @user = User.find(current_user)
    @users = User.all
    # @tag = Tag.new
    @tags = Tag.all