app/views/layouts/_photo_modal.html.erb

            <%#= f.hidden_field :photo_id, :value => nacho.id %>
            <%= f.collection_select :user_id, User.all, :id, :email, :class => 'form-select' %>
---
SELECT "users".* FROM "users"